Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །བདག་གིས་བཤགས་པ་བཞེས་ནས་ནི། །མྱ་ངན་སྡུག་བསྔལ་བྲལ་བར་སྨོན།
en: I pray that you accept my confession And free me from misery and fear. “ ‘

source: །བདག་ལ་ཉོན་མོངས་སྒྲིབ་པ་དང་། །རྣམ་སྨིན་ལས་ནི་ཅི་མཆིས་པ། །ཐུགས་རྗེ་ཆེན་པོའི་ཆབ་ཀྱིས་ནི། །རབ་བཀྲུས་བྱང་བར་མཛད་པར་སྨོན།
en: I pray that with the water of compassion You will wash me clean Of every kleśa obscuration And ripening karma that I have. “ ‘

source: །བདག་གིས་སྔོན་ཆད་སྡིག་པ་དང་། །ད་ལྟར་ལས་ངན་བགྱིས་པ་རྣམས། །རྩེ་གཅིག་སེམས་ཀྱིས་མནོལ་བཤགས་ན། །ཐམས་ཅད་རབ་ཏུ་བྱང་བར་ཤོག །
en: I one-pointedly confess and repent The bad actions that I have done in the past And the bad actions I have done in the present; May I be purified of them all. “ ‘

source: མ་འོངས་པ་ཡི་ལས་ངན་རྣམས། །བསྡམས་ཏེ་སློང་བར་ཡོང་མི་བགྱིད། །གལ་ཏེ་འགལ་བ་མཆིས་ན་ཡང་། །ནམས་ཀྱང་འཆབ་པར་ཡོང་མི་བགྱིད།
en: I make the commitment not to repeat These bad actions in the future, And if there is any transgression, Then I shall never conceal it. “ ‘

source: །ལུས་གསུམ་ངག་གི་རྣམ་པ་བཞི། །ཡིད་ཀྱི་ལས་ནི་རྣམ་པ་གསུམ། །སེམས་ཅན་རྣམས་ནི་འཆིང་བགྱིད་པས། །ཐོག་མ་མེད་ནས་རྒྱུན་མི་འཆད།
en: There are three physical acts, four vocal, And three kinds of mental actions That have placed beings in bondage Beginninglessly and continuously. “ ‘

source: །སྤྱོད་པ་འདི་གསུམ་དབང་གིས་ན། །མི་དགེ་ལས་བཅུ་བགྱིས་གྱུར་པས། །དེ་འདྲའི་ནོངས་པ་མང་པོ་རྣམས།
en: Through those three types of conduct The ten bad actions are done.

source: །དེ་དག་ཐམས་ཅད་སོ་སོར་བཤགས།
en: I make a confession of each of my Numerous errors of that kind. “ ‘

source: །བདག་གིས་ལས་ངན་མང་བགྱིས་པས། །སྡུག་བསྔལ་རྣམ་སྨིན་རང་ཉིད་མྱོང་། །སངས་རྒྱས་རྣམས་ཀྱི་སྤྱན་སྔར་ནི།
en: Because I have committed many bad actions, I will experience their ripening and suffering.

source: །བསམ་པ་ཐག་པས་སོ་སོར་བཤགས།
en: I sincerely confess each one of them In the presence of the buddhas. “ ‘

source: །འཛམ་བུའི་གླིང་ནི་འདི་དག་དང་། །འཇིག་རྟེན་ཁམས་ནི་གཞན་དག་ཏུ། །དགེ་བའི་ལས་མང་ཅི་མཆིས་པ། །དེང་བདག་ཐམས་ཅད་ཡི་རང་ངོ་།
en: Today I rejoice in all of The numerous good actions That exist in this Jambudvīpa And in other world realms. “ ‘

source: །མི་དགེ་ལས་བཅུ་རབ་སྤངས་ནས། །དགེ་བཅུ་ལམ་ནི་མངོན་བསྒྲུབས་ཏེ། །ས་བཅུ་དག་ལ་རབ་གནས་ནས། །ཕྱོགས་བཅུའི་སངས་རྒྱས་རྟག་མཐོང་སྨོན།
en: I pray that I will reject the ten bad actions, Practice the path of ten good actions, Be established upon the ten bhūmis, And always see the buddhas in the ten directions. “ ‘

source: །བདག་གིས་ལུས་དང་ངག་ཡིད་ཀྱིས། བསོད་ནམས་ཡེ་ཤེས་ལས་བསྒྲུབས་པའི། །དགེ་བའི་རྩ་བ་འདི་ཡི་མཐུས། །བླ་མེད་ཡེ་ཤེས་མྱུར་གྲུབ་ཤོག །དེང་བདག་སྟོབས་བཅུའི་སྤྱན་སྔར་མངོན་སུམ་དུ། །སྡུག་བསྔལ་བགེགས་མང་སྣ་ཚོགས་མཐོལ་ཞིང་བཤགས། །བྱིས་པ་སྲིད་གསུམ་རྨོངས་པའི་བགེགས་དག་དང་། །རྟག་པར་ལས་ངན་ལྕི་བར་བགྱིས་པའི་བགེགས། །བདག་གིས་ལོག་པའི་འདོད་པས་བསགས་པའི་བགེགས། །རྟག་ཏུ་སྲིད་བསྐྱེད་འཁོར་བར་འགྱུར་བའི་བགེགས། །འཇིག་རྟེན་འདི་ལ་མངོན་ཞེན་ཆགས་པའི་བགེགས། །བྱིས་པ་ཐམས་ཅད་ཀུན་གྱི་ཉོན་མོངས་བགེགས།
en: Through the power of the good roots That I have accomplished from merit and wisdom Through my body, speech and mind, May I quickly attain the highest wisdom. “ ‘

source: །སེམས་མྱོས་རྣམ་གཡེང་ཕྱིན་ཅི་ལོག་པའི་བགེགས། །མི་དགེ་གྲོགས་པོ་དག་ལ་བརྟེན་པའི་བགེགས། །འཁོར་བ་དག་ལ་འདོད་ཆགས་ཞེན་པའི་བགེགས། །ཞེ་སྡང་གཏི་མུག་གླེན་པས་སྡིག་བགྱིས་བགེགས། །མི་ཁོམ་བརྒྱད་སྐྱེ་མི་དགེ་གྲོགས་པོའི་བགེགས།
en: Today, in the presence of those who have the ten strengths, I confess and repent many various sufferings and obstacles: The obstacles from the stupidity of the fools in the three existences; The obstacles from always creating heavy bad karma; “ ‘The obstacles I have accumulated from wrong desires; The obstacles from continually circling through existences; The obstacles from attachment to this world; The obstacles from the kleśas of all childlike beings; “ ‘The obstacles from a crazed, distracted, erroneous mind; The obstacles from relying upon wicked friends; The obstacles from desire and attachment for saṃsāra; The obstacles from bad actions through anger, stupidity, and idiocy; “ ‘The obstacles from the eight unfortunate states and wicked friends; And the obstacles from not accumulating merit and good qualities.

source: །བསོད་ནམས་ཡོན་ཏན་མ་བསགས་པ་ཡི་བགེགས། །དེང་བདག་རྒྱལ་བ་ཀུན་གྱི་སྤྱན་སྔར་ནི། །སྡིག་པའི་ལས་ངན་མཐའ་ཡས་བགྱིས་པ་བཤགས།
en: Today, in the presence of all the jinas, I confess endless bad actions and sins. “ ‘

source: །དེང་བདག་བདེ་གཤེགས་ཀུན་ལ་སྐྱབས་སུ་མཆི། །བླ་མེད་ཡོན་ཏན་མཚོ་ལ་བདག་ཕྱག་འཚལ། །གསེར་གྱི་རི་ལྟར་ཕྱོགས་བཅུ་གསལ་མཛད་པ།
en: Today I go for refuge to all the tathāgatas, Who like golden mountains illuminate the ten directions. I pay homage to the unsurpassable ocean of qualities.

source: །བྱམས་དང་ཐུགས་རྗེས་བདག་ནི་གཟུང་དུ་གསོལ།
en: I pray that all tathāgatas hold me in their love and compassion. “ ‘

source: །སྐུ་ནི་གསེར་མདོག་རྣམ་དག་དྲི་མི་མངའ། །སྤྱན་ནི་རྣམ་དག་བཻ་ཌཱུརྱ་དང་འདྲ།
en: They have bodies that are golden, pure, and stainless; Their eyes are pure and are the color of beryl.

source: །དཔལ་དང་གཟི་བརྗིད་གྲགས་དང་ལྡན་པའི་གཙོ། །ཐུགས་རྗེ་ཤེས་རབ་ཉི་མས་མུན་སེལ་བ།
en: The lords who have glory, magnificence, and renown— The sun of their compassion and wisdom dispels darkness. “ ‘

source: །སངས་རྒྱས་ཉི་མའི་འོད་ཀྱིས་ཀུན་གསལ་མཛད།
en: The sunlight of the buddhas illuminates everywhere.

source: །ཤིན་ཏུ་རྣམ་དག་དྲི་མེད་རྡུལ་དང་བྲལ།
en: They are completely pure, stainless, free of impurities.

source: །ཐུབ་པའི་ཟླ་བས་གསལ་མཛད་རབ་བསིལ་བ། །སེམས་ཅན་ཉོན་མོངས་གདུང་བ་སེལ་བར་མཛད།
en: The moons of the munis illuminate and cool, Dispelling the torment of the kleśas in beings. “ ‘

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་གྱིས་རབ་བརྒྱན་ཅིང་། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་རྫོགས།
en: They are perfectly adorned by the thirty-two signs. They have the eighty excellent features, complete.

source: །ཡོན་ཏན་བསམ་དཀའ་མཚུངས་པ་མ་མཆིས་པས།
en: Their qualities are hard to comprehend and have no equal.

source: །ཉི་འོད་ལྟ་བུར་འཇིག་རྟེན་གསལ་བར་མཛད།
en: Like sunlight, they illuminate the world. “ ‘

source: །ཁ་དོག་བཻ་ཌཱུརྱ་འདྲ་དྲི་མེད་མངའ།
en: They have a stainless color like that of beryl.

source: །ཟླ་བ་ཉ་ལྟར་ནམ་མཁའ་དག་ལ་བཞུགས།
en: They are present in the sky, like the sun and moon.

source: །ཤེལ་མཆོག་དམ་པའི་དྲ་བས་གསེར་སྐུ་བསྒྲིབས།
en: Their golden bodies are covered by a net of sublime crystals.

source: །འོད་ཟེར་སྣ་ཚོགས་དག་གིས་རབ་ཏུ་བརྒྱན།
en: They are perfectly adorned by light rays of various colors. “ ‘

source: །འཁོར་བའི་སྡུག་བསྔལ་ཆུ་བོའི་ནང་དུ་ནི། །རྒ་ནད་མྱ་ངན་ཆུ་ཡིས་དེད་པས་ན།
en: In saṃsāra’s great river of suffering, One is swept along by the water of aging, illness, and misery.

source: །དེ་འདྲའི་སྡུག་བསྔལ་རྒྱ་མཚོ་བཟོད་དཀའ་བ། །སངས་རྒྱས་ཉི་མའི་འོད་ཀྱིས་གཏན་དུ་བསྐམས།
en: The unendurable ocean of that kind of suffering Is completely dried up by the sunlight of the buddhas. “ ‘

source: །དེང་བདག་སྟོང་གསུམ་འཇིག་རྟེན་རྨད་བྱུང་གཙོ། །ཐམས་ཅད་མཁྱེན་པ་སྤྱི་བཏུད་ཕྱག་འཚལ་ལོ།
en: Today, I pay homage and bow down to the omniscient ones, The wonderful lords of the trichiliocosm world realm.

source: །འོད་ཟེར་རབ་གསལ་གསེར་མདོག་འདྲ་བའི་སྐུ། །དཔེ་བྱད་དམ་པ་སྣ་ཚོགས་དག་གིས་བརྒྱན།
en: Their bodies are the color of gold with bright light rays And adorned by the various sublime features. “ ‘

source: །ཇི་ལྟར་རྒྱ་མཚོའི་ཆུ་ཚད་ཤེས་དཀའ་ཞིང་། །ས་ཆེན་རྡུལ་ནི་བགྲང་དུ་མ་མཆིས་དང་། །ཇི་ལྟར་རི་རབ་སྲང་གྲངས་གཞལ་དཀའ་ཞིང་། །ནམ་མཁའ་དག་ལ་མུ་མཐའ་མ་མཆིས་ལྟར། །སངས་རྒྱས་རྣམས་ཀྱི་ཡོན་ཏན་དེ་བཞིན་ཏེ།
en: Just as the water of the ocean is immeasurable, Just as the particles in the earth are uncountable, Just as the heaviness of Sumeru is unweighable, And just as the extent of space has no end, “ ‘That is how the qualities of the buddhas are.

source: །སེམས་ཅན་ཐམས་ཅད་ཀུན་གྱིས་རིག་མི་འགྱུར།
en: There is not a single being who can know them.

source: །བསྐལ་པ་ཚད་མེད་སྙེད་དུ་རབ་བསམས་ཀྱང་། །ཡོན་ཏན་རྒྱ་མཚོའི་ཕ་མཐའ་རྟོགས་མི་འགྱུར།
en: Even if they were contemplated for countless eons, The limits of the ocean of their qualities could not be known. “ ‘

source: །ས་ཆེན་འདི་ཡི་རི་བྲག་ཇི་སྙེད་པ། །རྡུལ་ཕྲན་བཞིན་དུ་གསེས་ཀྱང་བརྩིར་རུང་ཞིང་། །རྒྱ་མཚོའི་ཆབ་ནི་སྤུ་རྩེས་གཞལ་རུང་ཡང་། །སངས་རྒྱས་ཡོན་ཏན་བགྲང་བར་རྔོ་མི་ཐོགས།
en: All the mountains on this great earth Could be crushed into the smallest particles and counted, The waters of the ocean could be calculated with a hair tip, But no one could count the qualities of a buddha. “ ‘

source: །སེམས་ཅན་ཐམས་ཅད་ལྷན་ཅིག་འདུས་ནས་ནི། །བཅོམ་ལྡན་གྲགས་པའི་ཆོས་ནི་ཐམས་ཅད་དང་། །མཚན་བཟང་རྣམ་དག་དཀོན་མཆོག་བསྔགས་བརྗོད་ཀྱང་། །དེ་ཡི་ཕ་མཐའ་དཔག་པར་ཡོངས་མི་འགྱུར།
en: If all beings were to be gathered together And were to praise all the renowned qualities And the rare, pure, excellent characteristics of the bhagavats, They would never reach the end of listing them. “ ‘

source: །བདག་གི་དགེ་བའི་ལས་མང་ཅི་མཆིས་པས། །མྱུར་དུ་བླ་ན་མ་མཆིས་གཙོ་གྲུབ་ནས། །ཡང་དག་ཆོས་བཤད་སྐྱེ་དགུ་ཕན་བཏགས་ཏེ། །ཐམས་ཅད་སྡུག་བསྔལ་མང་ལས་ཐར་བགྱིད་ཤོག །
en: Through the numerous good actions that I have done, May I quickly accomplish being an unsurpassable lord Who teaches the true Dharma, brings benefit to beings, And frees them from all their many sufferings. “ ‘

source: བདུད་ཀྱི་དམག་ཚོགས་སྟོབས་ཆེན་རབ་བཏུལ་ནས། །བླ་མེད་དམ་ཆོས་འཁོར་ལོ་བསྐོར་བར་ཤོག །
en: May I subjugate Māra’s powerful army And turn the wheel of the sublime, highest Dharma.

source: བསྐལ་པ་གྲངས་མེད་བསམ་མི་ཁྱབ་གནས་ནས། །བདུད་རྩིའི་རོ་ཡིས་སེམས་ཅན་ཚིམ་བགྱིད་ཤོག །
en: May I remain for countless, innumerable eons And satisfy beings with the flavor of amṛta. “ ‘

source: འདས་པའི་རྒྱལ་བ་རྣམས་ནི་ཇི་ལྟ་བཞིན། །ཕ་རོལ་ཕྱིན་དྲུག་ཡོངས་སུ་རྫོགས་བགྱིད་ཤོག །
en: May I bring to completion the six perfections In the same way as the jinas of the past have done.

source: འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ཞི་གྱུར་ནས། །ཉོན་མོངས་བཏུལ་ཏེ་སྡུག་བསྔལ་བསལ་བར་ཤོག །
en: May I bring desire, anger, and ignorance to an end, Subjugate the kleśas, and eliminate suffering. “ ‘

source: བདག་གིས་རྟག་ཏུ་ཚེ་རབས་དྲན་གྱུར་ནས། །འདས་པའི་སྐྱེ་བ་བརྒྱ་སྟོང་དྲན་པ་དང་།
en: May I always remember my lifetimes; May I remember a hundred thousand past lifetimes.

source: །རྟག་པར་ཐུབ་པའི་གཙོ་བོ་དྲན་གྱུར་ཏེ། །སངས་རྒྱས་ཟབ་མོའི་ཆོས་ནི་ཐོས་པར་ཤོག །
en: May I always remember the lords of munis And hear the profound Dharma of the buddhas. “ ‘

source: བདག་གི་དགེ་བའི་ལས་ནི་འདི་རྣམས་ཀྱིས། །རྒྱལ་བ་ཚད་མེད་དག་ལ་བསྙེན་བཀུར་ནས། །མི་དགེ་བ་ཡི་རྒྱུ་ཀུན་ཡོངས་སྤངས་ཏེ། །ཡང་དག་དམ་ཆོས་རྟག་ཏུ་སྒྲུབ་པར་ཤོག །
en: May I, through these good actions, Attend upon countless jinas, Forsake completely the causes that are bad actions, And always practice the true Dharma. “ ‘

source: འཇིག་རྟེན་ཐམས་ཅད་སེམས་ཅན་ཇི་སྙེད་པ། །སྡུག་བསྔལ་སྤངས་ནས་བདེ་བ་ཐོབ་པར་ཤོག །
en: May all the beings throughout every world Become free of suffering and attain happiness.

source: དབང་པོ་མ་ཚང་ཇི་སྙེད་མཆིས་པ་དག །དེ་དག་ལུས་ཀྱི་མཚན་རྣམས་ཡོངས་རྫོགས་ཤོག །སེམས་ཅན་གང་ཞིག་ནད་ཀྱི་སྡུག་བསྔལ་གྱིས།
en: May all those with incomplete faculties Have their physical features made complete. “ ‘

source: །ལུས་ནི་ཉམ་ཆུང་སྐྱབས་བགྱིད་མ་མཆིས་པ། །ཐམས་ཅད་ནད་ཀྱི་སྡུག་བསྔལ་ར་བཞི་ནས། །དབང་པོ་ཁ་དོག་མཐུ་ནི་རྒྱས་པར་ཤོག །གང་གིས་རྒྱལ་ཆོས་འགལ་བགྱིས་བསད་ལ་ཐུག །སྡུག་བསྔལ་མང་གཙེས་མྱ་ངན་རབ་སྐྱེས་ནས།
en: May beings with no protector, and bodies Weakened by the suffering of their illness, All have the suffering of their illness cease And have improved faculties, color, and power. “ ‘

source: །དེ་ཡིས་སྡུག་བསྔལ་མི་བཟད་མྱོང་བའི་ཚེ། །མགོན་སྐྱབས་དག་ནི་བགྱིད་པ་མ་མཆིས་དང་། །གང་དག་གཞུ་བརྡེག་མཚོན་ཆས་བཅིངས་པ་དང་། །གནོད་བྱེད་ཡོ་བྱད་སྣ་ཚོགས་ལུས་ཉོན་མོངས། །མྱ་ངན་བརྒྱ་སྟོང་ཚད་མེད་མྱོང་བ་ན།
en: May those to be executed for breaking the king’s law, Who are tormented by many sufferings and in extreme misery, Who are experiencing this unendurable suffering Without having anyone to protect or save them— “ ‘And those who are struck by weapons and bound, Whose bodies are tortured by various harmful instruments And are experiencing countless thousands of miseries, Their bodies in pain and without the slightest happiness— “ ‘May all of them become freed from their bonds, From the beatings, suffering, and torments.

source: །ལུས་སེམས་རབ་གཟེར་བདེ་བ་ཅུང་ཟད་མེད། །དེ་དག་ཐམས་ཅད་བཅིངས་ཤིང་བརྡེགས་པ་དང་། །སྡུག་བསྔལ་ཉོན་མོངས་དག་ལས་ཐར་བར་ཤོག །བསད་ལ་ཐུག་པ་དག་ནི་སྲོག་ཐོབ་ནས། །སྡུག་བསྔལ་མང་པོ་ཐམས་ཅད་གཏན་ཟད་ཤོག །
en: May the lives of those to be killed be saved And all their many sufferings completely cease. “ ‘

source: སེམས་ཅན་གང་ཞིག་བཀྲེས་སྐོམ་གདུངས་གྱུར་པ། །རོ་མཆོག་དམ་པ་སྣ་ཚོགས་འཐོབ་པར་ཤོག །
en: May beings who are pained by hunger and thirst Obtain various kinds of the sublime, best flavors.

source: ལོང་བས་གཟུགས་མཐོང་འོན་པས་སྒྲ་ཐོས་དང་། །ཐིང་པོས་འགྲོ་ནུས་ལྐུགས་པ་སྨྲ་ནུས་ཤོག །
en: May the blind see forms, the deaf hear sounds, The crippled walk, and the mute speak. “ ‘

source: དབུལ་ཕོངས་སེམས་ཅན་རིན་ཆེན་གཏེར་ཐོབ་ནས། །བང་མཛོད་རབ་རྒྱས་རྒུད་པ་མ་མཆིས་ཏེ། །ཐམས་ཅད་བདེ་མཆོག་དམ་པ་རབ་རྙེད་ནས། །སེམས་ཅན་སྡུག་བསྔལ་མྱོང་བ་མ་མཆིས་ཤོག །
en: May poor beings obtain a treasure of jewels, Have a treasury that increases and never diminishes, And may all beings attain sublime, supreme happiness And never experience suffering. “ ‘

source: ལྷ་མི་ཐམས་ཅད་མཐོང་བར་མོས་པ་ཡི། །བྱད་བཞིན་དམ་པ་རབ་མཛེས་ཐོབ་གྱུར་ནས། །བདེ་བ་ཚད་མེད་མངོན་སུམ་མྱོང་གྱུར་ཏེ། །ལོངས་སྤྱོད་འབྱོར་རྒྱས་བསོད་ནམས་ལྡན་པར་ཤོག །
en: May they obtain a beautiful, sublime appearance That all devas and humans will wish to see, And may they directly experience limitless happiness And possess pleasures, prosperity, and merit. “ ‘

source: སེམས་ཅན་དེ་དག་རོལ་མོ་བསམས་པ་བཞིན། །སྒྲ་མཆོག་མང་པོ་མངོན་དུ་འབྱུང་བར་ཤོག །
en: May there arise many kinds of perfect music That are the exact music those beings wish to hear.

source: ཆུ་འདོད་གསེར་གྱི་མེ་ཏོག་སྟེང་འཕྱོ་བ། །རབ་བསིལ་རྫིང་བུ་མངོན་དུ་སྣང་བར་ཤོག །
en: If they wish for water, may there appear perfectly cool pools Upon which float flowers of gold. “ ‘

source: སེམས་ཅན་དེ་དག་ཇི་ལྟར་བསམས་པ་བཞིན། །བཟའ་བཏུང་གོས་དང་ཁྲི་དང་སྟན་རྣམས་དང་། །གསེར་དངུལ་དང་ནི་རིན་ཆེན་བཻ་ཌཱུརྱ། །རྒྱན་ཕྲེང་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་ཤོག །
en: May what those beings wish for— Food, drink, clothes, thrones, and seats; Gold, silver, and beryl jewels, And every string of jewelry—perfectly appear. “ ‘

source: སེམས་ཅན་མི་སྙན་ཐོས་པར་མི་འགྱུར་ཞིང་། །ཕན་ཚུན་མི་མཐུན་མཐོང་བར་མ་གྱུར་ཅིག །
en: May beings not hear anything unpleasant And not see any disharmony between anyone.

source: ལུས་ཀྱི་བྱད་བཞིན་ཐམས་ཅད་རབ་མཛེས་ཤིང་། །སོ་སོར་བྱམས་པའི་སེམས་ཀྱིས་བརྩེ་བགྱིད་ཤོག །
en: May all their physical features be beautiful, And may each being be kind and loving. “ ‘

source: འཇིག་རྟེན་བདེ་བའི་ཡོ་བྱད་ལོངས་སྤྱོད་རྣམས། །ཡིད་ལ་བསམས་ཚེ་ཐམས་ཅད་འབྱོར་པར་ཤོག །
en: May they obtain, as soon as they think of them, Every possession and requisite that brings happiness in the world.

source: ནོར་རྣམས་རྙེད་པ་ཕོངས་པ་མ་མཆིས་པར། །བགོ་བཤའ་བགྱིས་ཏེ་སེམས་ཅན་གཏོང་བར་ཤོག །
en: May they find wealth and without ever being in need Divide their possessions and give them to beings. “ ‘

source: བདུག་སྤོས་ཕྱེ་མ་དང་ནི་བྱུག་སྤོས་དང་། །མེ་ཏོག་སྣ་ཚོགས་ཁ་དོག་གཅིག་མིན་པ། །ཉིན་རེ་དུས་གསུམ་ཤིང་ལས་ལྷུང་གྱུར་ནས། །ཡིད་བཞིན་ལོངས་སྤྱོད་དགའ་བསྐྱེད་པར་ཤོག །
en: May incense and perfumes, powders and ointments, Various flowers of every kind of color Fall from the trees three times each day, And may there be happiness from the enjoyments wished for. “ ‘

source: སེམས་ཅན་ཐམས་ཅད་ཕྱོགས་བཅུའི་རྒྱལ་གཙོ་དང་། །ཐེག་གསུམ་རྣམ་དག་གྱ་ནོམ་ཆོས་ཀྱི་སྐུ། །བྱང་ཆུབ་སེམས་དཔའ་དང་ནི་རང་རྒྱལ་དང་། །ཉན་ཐོས་དགེ་འདུན་མཆོད་པ་བགྱིད་པར་ཤོག །
en: May all beings make offerings to the jina lords In the ten directions; to the three yānas, The pure and sublime doors to the Dharma; and to the saṅgha of Bodhisattvas, pratyekabuddhas, and śrāvakas. “ ‘

source: རྟག་ཏུ་མ་རབས་དག་ཏུ་མི་སྐྱེ་ཞིང་། །མི་ཁོམ་བརྒྱད་པོ་དག་ཏུ་མི་ལྟུང་དང་། །དལ་འབྱོར་མི་ཡི་གཙོ་བོར་སྐྱེས་གྱུར་ཏེ། །ཕྱོགས་བཅུའི་སངས་རྒྱས་རིམ་གྲོ་བགྱིད་པར་ཤོག །
en: May they never have a low rebirth Or fall into the eight unfortunate states, But gain a supreme human’s riches and freedoms And attend on the buddhas in the ten directions. “ ‘

source: རྟག་པར་ཕྱུག་པོ་དག་གི་ཁྱིམ་སྐྱེས་ཏེ། །ནོར་དང་རིན་ཆེན་བང་མཛོད་རྒྱས་པ་དང་། །བྱེད་བཞིན་གྲགས་པ་དཔེ་ཟླ་མ་མཆིས་ཏེ། །ཚེ་རིང་བསྐལ་པ་གྲངས་མེད་གནས་པར་ཤོག །
en: May they always be reborn into a wealthy family With a vast treasury of wealth and jewels, With a body and fame that are without equal And a long life that lasts for countless eons. “ ‘

source: བུད་མེད་ཐམས་ཅད་ཀུན་ནི་ཕོར་གྱུར་ནས། །དཔའ་ཞིང་སེམས་རྣོ་བློ་གྲོས་ཤིན་ཏུ་ཆེ།
en: May all women become males, Heroic, with sharp minds and great intelligence.

source: །ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་ལམ་སྤྱད་ནས། །ཕ་རོལ་ཕྱིན་དྲུག་སྒྲུབ་ལ་བརྩོན་པར་ཤོག །
en: May they all practice the bodhisattva’s path And be dedicated to accomplishing the six perfections. “ ‘

source: རྟག་པར་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཚད་མེད་སྙེད། །རིན་ཆེན་ཤིང་རྒྱལ་དྲུང་དུ་གཤེགས་ནས་ནི། །བཻ་ཌཱུརྱ་ཡི་གདན་ལ་རབ་བཞུགས་ཏེ། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མཐོང་བར་ཤོག །
en: May they always see all the countless buddhas in the ten directions Who have gone to the feet of victorious, precious trees, Who are seated perfectly upon their thrones of beryl, And who are turning their wheels of the Dharma. “ ‘

source: གལ་ཏེ་འདས་པ་དང་ནི་ད་ལྟར་ཚེ། །སྲིད་གསུམ་འཁོར་ནས་ལས་རྣམས་བགྱིས་པས་ན། །ཡིད་དུ་མི་མཆི་ངན་འགྲོ་ཐོབ་གྱུར་པ། །ཐམས་ཅད་མ་ལུས་གཏན་དུ་བྱང་བར་ཤོག །
en: If I have committed actions in past lives or the present While in the circle of the three existences That I am unaware of but that result in the lower existences, May I be purified of them all, without remainder. “ ‘

source: སེམས་ཅན་ཐམས་ཅད་སྲིད་པའི་རྒྱ་མཚོར་ནི། །འཁོར་བའི་ཞགས་པས་དམ་དུ་བཅིངས་པ་ནི། །ཤེས་རབ་རལ་གྲི་དག་གིས་བཅད་བསལ་ཏེ། །སྡུག་བསྔལ་སྤངས་ནས་བྱང་ཆུབ་མྱུར་ཐོབ་ཤོག །སེམས་ཅན་གང་གིས་འཛམ་གླིང་འདི་དག་དང་།
en: May all beings who are in the ocean of existence, Tightly bound by the noose of saṃsāra, Be cut free by the sword of wisdom And, freed from suffering, quickly attain enlightenment. “ ‘

source: །ཡང་ན་འཇིག་རྟེན་གཞན་དག་ཏུ་ཡང་རུང་། །བསོད་ནམས་རྒྱུན་མཆོག་སྣ་ཚོགས་ཅི་བསྒྲུབས་པ། །དེ་དག་ཐམས་ཅད་ཀུན་ལ་ཡི་རང་ངོ་།
en: I rejoice in the entirety of all The perfect, continuous merits That are accomplished by beings in Jambudvīpa Or in any other world realm whatsoever. “ ‘

source: །བསོད་ནམས་དངོས་པོ་དག་ལ་ཡི་རང་དང་། །ལུས་དང་ངག་ཡིད་དགེ་བ་མང་བགྱིས་དེས། །ལས་མཆོག་དམ་པ་འདི་དག་རྟག་འཕེལ་ནས། །བླ་མེད་བྱང་ཆུབ་ཆེན་པོ་མྱུར་ཐོབ་སྨོན།
en: I pray that the merit and rejoicing in The many good actions of body, speech, and mind, And this sublime, perfect action, constantly increase, So that the highest, great enlightenment will be attained. “ ‘

source: །ཕྱག་བགྱིས་སངས་རྒྱས་ཡོན་ཏན་བསྔགས་པ་དང་། །བསམ་པ་དང་ཞིང་རྙོག་པ་མ་མཆིས་པས། །བསྔོ་ཞིང་སྨོན་ལམ་བཏབ་པའི་བསོད་ནམས་དེས། །བསྐལ་པ་དྲུག་ཅུའི་ངན་འགྲོ་འདས་པར་སྨོན།
en: By the merit of homage and praising a buddha’s qualities, With a mind that is pure and unpolluted, And by making dedications and prayers, I pray that for sixty eons the lower existences will be transcended. “ ‘

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དང་། །བྲམ་ཟེ་ལ་སོགས་རིགས་མཆོག་དམ་པ་རྣམས། །ཐལ་སྦྱར་རྩེ་གཅིག་སངས་རྒྱས་བསྔགས་བརྗོད་ན། །སྐྱེ་བ་རྟག་པར་ཀུན་དུ་ཚེ་རབས་དྲན།
en: If noble men and noble women, brahmins, And the other sublime, supreme classes Single-pointedly praise the buddhas with palms together, Then in all their lives they will remember their lifetimes. “ ‘

source: །དབང་པོ་ཚང་ཞིང་ལུས་ནི་ཡོངས་རྫོགས་ཏེ། །ཡོན་ཏན་དམ་པ་ཐམས་ཅད་ཕུན་ཚོགས་འགྱུར།
en: They will have complete faculties and perfect bodies And will have a perfection of all sublime qualities.

source: །མ་འོངས་པ་ཡི་སྐྱེ་བ་ཐམས་ཅད་དུ། །རྟག་པར་ལྷ་མི་རྣམས་ཀྱིས་བལྟ་བར་ཤོག །
en: Throughout all their future lifetimes, may they Always be looked up to by devas and humans. “ ‘

source: སངས་རྒྱས་གཅིག་དང་སངས་རྒྱས་བཅུ་དག་ལས། །དགེ་བའི་རྩ་བ་བསྒྲུབས་ནས་ཐོབ་པ་མིན། །སངས་རྒྱས་བརྒྱ་སྟོང་དགེ་རྩ་བསྐྱེད་པས་ན། །འགྱོད་ཚངས་ཆོས་འདི་ཐོས་པར་གྱུར་པ་ཡིན།
en: This Dharma of purity through regret is not heard By attaining the accomplishment of good roots With just one buddha or with ten buddhas, But through generating good roots with a hundred thousand buddhas.’ ”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་གསོལ་པ་གསན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ལ་ལེགས་སོ་ལེགས་སོ་ཞེས་བསྔགས་པ་བརྗོད་ནས།
en: Then the Bhagavat, having listened to what was addressed to him, praised the bodhisattva Ruciraketu by saying, “Excellent, excellent!

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཇི་ལྟར་རྨི་ལམ་དུ་གསེར་གྱི་རྔ་བོ་ཆེ་ལས་བྱུང་བའི་སྒྲས་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་བསྔགས་པ་བརྗོད་པ་དང་། འགྱོད་ཚངས་བྱ་བའི་ཆོས་བསྟན་པ་མཐོང་བ་གང་ཡིན་པ་དེ་གང་ལ་ལ་ཞིག་གིས་ཐོས་པར་གྱུར་ན་བསོད་ནམས་ཤིན་ཏུ་མང་པོ་འཐོབ་པར་འགྱུར་ཞིང་སེམས་ཅན་ལ་རྒྱ་ཆེར་ཕན་འདོགས་པ་དང་། ཁ་ན་མ་ཐོ་བའི་སྒྲིབ་པ་ཡོངས་སུ་བྱང་བར་འགྱུར་རོ།
en: Noble one, those who hear the Dharma teaching of praises of the qualities of the tathāgatas and purification through regret, which you saw emerge from a great golden drum in your dream, will attain extremely great merit, will bring a vast benefit to beings, and will be purified of all sins. “

source: །ཁྱོད་ཀྱི་ལས་མཆོག་དམ་པ་འདི་དག་ཐམས་ཅད་ནི་འདས་པའི་དུས་སུ་བསྔགས་པ་བརྗོད་ཅིང་སྨོན་ལམ་བཏབ་པའི་སྔོན་གྱི་བག་ཆགས་ཀྱི་རྒྱུ་རྐྱེན་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་མཐུས་རྒྱུ་རྐྱེན་འདི་དག་ཁྱོད་ལ་བསྟན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Know that all of this sublime, perfect activity of yours is because of the causes and conditions of your previously established propensities for praising and praying in past lives, and through the power of the blessing of the tathāgatas through which these causes and conditions have been revealed to you.”

source: །དེའི་ཚེ་འཁོར་མང་པོ་རྣམས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་ཐོས་ནས་ཐམས་ཅད་རབ་ཏུ་དགའ་ཞིང་མངོན་པར་ཡིད་ཆེས་ནས་བཀའ་བཞིན་དུ་སྤྱོད་པར་གྱུར་ཏོ།
en: At that time the great assembly, having heard those words, were all overjoyed and with conviction practiced in accordance with that teaching.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་རྨི་ལམ་ན་འགྱོད་ཚངས་བྱེད་པ་མཐོང་བའི་ལེའུ་སྟེ་བཞི་པའོ།། །།གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ། བམ་པོ་གསུམ་པ།
en: This concludes “The Vision in a Dream of Purification through Regret,” the fourth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡང་དག་པའི་རྣམ་པར་རྟོག་པ་ལ་བཞུགས་ཏེ་ཤིན་ཏུ་ཟབ་ཅིང་གྱ་ནོམ་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་དང་།
en: Chapter 5: The Purification of the Obscuration from Karma Then the Bhagavat, residing in correct analysis, entered into an extremely profound, excellent samādhi.

source: སྐུའི་སྤུའི་བུ་གནས་ཁ་དོག་རྣམ་པ་སྣ་ཚོགས་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་དང་ལྡན་པའི་འོད་ཟེར་ཆེན་པོ་བཀྱེ་བས་ཕྱོགས་བཅུའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དག་གི་ཚད་དང་དཔེར་བྱར་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་འོད་ཟེར་གྱིས་རབ་ཏུ་སྣང་བར་གྱུར་ཏོ། །སྙིགས་མ་ལྔའི་འཇིག་རྟེན་དག་ཏུ་འོད་ཟེར་གྱིས་སྣང་བར་བྱས་པས་སེམས་ཅན་གང་དག་མི་དགེ་བ་བཅུའི་ལས་དང་། མཚམས་མེད་པ་ལྔའི་ཁ་ན་མ་ཐོ་བ་དང་།
en: From the pores of his body there came many countless hundreds of thousands of great light rays of various colors, and the light rays illuminated buddha realms so numerous they could not be exemplified or measured even by the number of sand grains in all the Ganges Rivers in the ten directions.

source: དཀོན་མཆོག་གསུམ་ལ་སྐུར་པ་བཏབ་པ་དང་། བླ་མ་དང་ཉེ་བ་དག་ལ་སྲི་ཞུ་མ་བྱས་པ་དང་། མཁན་པོ་དང་བྲམ་ཟེ་དག་ལ་བརྙས་ཤིང་ང་རྒྱལ་བྱས་པས་སེམས་ཅན་དམྱལ་བ་དང་། ཡི་དགས་དང་། དུད་འགྲོའི་སྐྱེ་གནས་སུ་ལྟུང་བར་གྱུར་པ་དེ་དག་སོ་སོ་ནས་འོད་ཟེར་གྱི་སྣང་བ་དེ་དག་གི་གནས་སུ་ཕྱིན་པར་གྱུར་པས་སེམས་ཅན་དེ་དག་འོད་ཟེར་དེ་མཐོང་བ་དང་།
en: In the world realms with the five degenerations that were illuminated by those light rays, the radiance of those light rays shone out toward the individual locations of those beings who had fallen into existences as hell beings, as animals, and as pretas through following the path of the ten bad actions, committing the five actions with immediate result upon death, maligning the Three Jewels, having disrespect for gurus and family, and dishonoring and being arrogant toward upādhyāyas and brahmins.

source: འོད་ཟེར་གྱི་མཐུས་ཐམས་ཅད་ཀྱིས་བདེ་བ་དང་། ཤིན་ཏུ་སྡུག་ཅིང་མཛེས་པའི་གཟུགས་ཀྱིས་མཚན་ཕུན་སུམ་ཚོགས་པ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱིས་བརྒྱན་ནས་སངས་རྒྱས་རྣམས་མཐོང་བར་གྱུར་ཏོ།
en: When those beings saw those light rays, through the power of the light rays they all became happy, and in attractive, beautiful bodies adorned with the perfect physical signs, merit, and wisdom, they saw the buddhas.
